# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Binaries
brew install bash
brew install bat
brew install coreutils
brew install ffmpeg
brew install gh
brew install git
brew install grep
brew install httpie
brew install mackup
brew install mas
brew install pkg-config
brew install stripe
brew install trash
brew install tree
brew install youtube-dl
brew install zlib
brew install wget

brew install php
brew install composer
brew install mysql
brew install nginx
brew install node
brew install redis
brew install yarn
brew install postgresql@9.5
brew install redis
brew install mkcert
brew cask install google-cloud-sdk
brew install pandoc
brew install netcdf
brew install gettext
brew install gdal
brew cask install qlcolorcode
brew cask install qlmarkdown
brew cask install quicklook-json
brew cask install quicklook-csv
brew cask install qlstephen
brew cask install font-lato
brew cask install font-open-sans
brew cask install font-source-code-pro-for-powerline
brew cask install font-source-code-pro
brew cask install font-source-sans-pro
brew cask install font-source-serif-pro


## Unknown dependencies
# brew 'gdk-pixbuf'

# brew 'glib-networking'
# brew 'gobject-introspection'
# brew 'graphviz'
# brew 'gtkmm'
# brew 'librsvg'
# brew 'libsoup'
# brew 'llvm'
# brew 'mariadb-connector-c'
# brew 'mkcert'


# Utilities
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'istat-menus'
cask 'keyboard-maestro'


# Management (Files, Stuff)
cask 'daisydisk'
cask 'google-backup-and-sync'
cask 'dropbox'
cask 'gemini'
cask 'handbrake'
cask 'carbon-copy-cloner'
cask 'cardhop'
cask 'transmission'

# Media
cask 'audio-hijack'
cask 'vlc'

# Dev
cask 'tableplus'
cask 'mactex'
cask 'openrefine'
cask 'r'
cask 'rstudio'
cask 'sourcetree'
cask 'sublime-text'
cask 'insomnia'

# Browse and Comms
cask 'firefox'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'whatsapp'


## Unused (for now...)
#cask 'screenflow'
#cask 'steam'
#cask 'the-unarchiver'
#cask 'transmit'
#cask 'vagrant'



# Mac App Store
mas 'Dice', id: 1479250666
mas 'Drafts', id: 1435957248
mas 'Fantastical - Calendar & Tasks', id: 975937182
mas 'FruitJuice', id: 671736912
mas 'Microsoft To Do', id: 1274495053
mas 'Things', id: 904280696
mas 'TogglDesktop', id: 957734279
mas 'Tweetbot', id: 1384080005
mas 'Xcode', id: 497799835




# mas 'Final Cut Pro', id: 424389933

## Laptop Only
# brew cask install tripmode
# mas 'fruitjuice'
