# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/bundle'

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # 'cat' on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'youtube-dl'
brew 'zlib' # Needed for Memcached
brew 'wget'

# Development
brew 'php'
brew 'php@7.3'
brew 'php@7.2'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'postgresql@9.5'
brew 'redis'
brew 'mkcert'

# Data
brew 'pandoc'
brew 'netcdf'
brew 'gettext'
brew 'gdal'

## Unknown dependencies
# brew 'gdk-pixbuf'

# brew 'glib-networking'
# brew 'gobject-introspection'
# brew 'graphviz'
# brew 'gtkmm'
# brew 'librsvg'
# brew 'libsoup'
# brew 'llvm'
# brew 'mariadb-connector-c'
# brew 'mkcert'


# Utilities
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'bettertouchtool'
cask 'caffeine'
cask 'istat-menus'
cask 'keyboard-maestro'


# Management (Files, Stuff)
cask 'daisydisk'
cask 'google-backup-and-sync'
cask 'dropbox'
cask 'gemini'
cask 'handbrake'
cask 'carbon-copy-cloner'
cask 'cardhop'
cask 'transmission'

# Media
cask 'audio-hijack'
cask 'vlc'

# Dev
cask 'tableplus'
cask 'mactex'
cask 'openrefine'
cask 'r'
cask 'rstudio'
cask 'sourcetree'
cask 'sublime-text'

# Browse and Comms
cask 'firefox'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'whatsapp'


## Unused (for now...)
#cask 'insomnia'
#cask 'screenflow'
#cask 'steam'
#cask 'the-unarchiver'
#cask 'transmit'
#cask 'vagrant'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Dice', id: 1479250666
mas 'Drafts', id: 1435957248
mas 'Fantastical - Calendar & Tasks', id: 975937182
mas 'FruitJuice', id: 671736912
mas 'Microsoft To Do', id: 1274495053
mas 'Things', id: 904280696
mas 'TogglDesktop', id: 957734279
mas 'Tweetbot', id: 1384080005
mas 'Xcode', id: 497799835




# mas 'Final Cut Pro', id: 424389933

## Laptop Only
# cask 'tripmode'
# mas 'fruitjuice'
