



brew 'grep'
brew 'httpie'
brew 'mas'
# brew 'pkg-config'
# brew 'stripe'
# brew 'trash'
# brew 'tree'
brew 'yt-dlp'
# brew 'zlib'

brew 'mysql'
# brew 'mkcert'
# cask 'google-cloud-sdk'
brew 'pandoc'
# brew 'netcdf'
# brew 'gettext'
# brew 'gdal'
# cask 'qlcolorcode'
# cask 'qlmarkdown'
# cask 'quicklook-json'
# cask 'quicklook-csv'
# cask 'qlstephen'
# cask 'font-lato'
# cask 'font-open-sans'
# cask 'font-source-code-pro-for-powerline'
# cask 'font-source-code-pro'
# cask 'font-source-sans-pro'
# cask 'font-source-serif-pro'


## Unknown dependencies
# brew 'gdk-pixbuf

# brew 'glib-networking'
# brew 'gobject-introspection'
# brew 'graphviz'
# brew 'gtkmm'
# brew 'librsvg'
# brew 'libsoup'
# brew 'llvm'
# brew 'mariadb-connector-c'
# brew 'mkcert'

# Utilities
cask 'bettertouchtool'
# cask '1password'
cask 'istat-menus'
cask 'keyboard-maestro'
cask 'raycast'
cask 'textexpander'


# Management (Files, Stuff)
cask 'daisydisk'
cask 'dropbox'
cask 'gemini'
cask 'handbrake'
cask 'carbon-copy-cloner'
cask 'cardhop'

# # Media
# cask 'audio-hijack'
cask 'vlc'

# # Dev
cask 'tableplus'
cask 'visual-studio-code'
cask 'iterm2'
cask 'docker'
cask 'phpstorm'


# # Data
# cask 'mactex'
cask 'openrefine'
cask 'r'
cask 'rstudio'
cask 'insomnia'

# # Browse and Comms
cask 'firefox'
cask 'google-chrome'
cask 'skype'
cask 'arc'
# cask 'slack'
cask 'whatsapp'
cask 'spotify'
